### Data cleaning process.
### Python techniques will be covered:

#### 1. Remove multiple Irrelevant columns from the dataset
#### 2. Remove multiple rows if contains specific substrings
#### 3. Handle null and missing values
#### 4. Transform column value if it contains specific substring.
#### 5. Remove substring from string column
#### 6. Split string column by separator and convert result to int type.
#### 7. Strip letters from the left of a string column
#### 8. Count number of rows that contains substring appears in a column with conditions.

In [2]:
import pandas as pd 
import numpy as np

In [3]:
all_data = pd.read_csv('DataScientist.csv')

In [4]:
len(all_data)

3909

In [3]:
len(all_data)

3909

In [4]:
all_data.iloc[9]

Unnamed: 0                                                           9
index                                                                9
Job Title                                      Quantitative Researcher
Salary Estimate                           $111K-$181K (Glassdoor est.)
Job Description      About the Position\n\n\nAt Jane Street, we con...
Rating                                                             4.8
Company Name                                          Jane Street\n4.8
Location                                                  New York, NY
Headquarters                                              New York, NY
Size                                             501 to 1000 employees
Founded                                                           2000
Type of ownership                                    Company - Private
Industry                         Investment Banking & Asset Management
Sector                                                         Finance
Revenue                                       Unknown / Non-Applicable
Competitors                                                         -1
Easy Apply                                                          -1
Name: 9, dtype: object

In [5]:
len(all_data.columns)

17

In [6]:
all_data.columns

Index(['Unnamed: 0', 'index', 'Job Title', 'Salary Estimate',
       'Job Description', 'Rating', 'Company Name', 'Location', 'Headquarters',
       'Size', 'Founded', 'Type of ownership', 'Industry', 'Sector', 'Revenue',
       'Competitors', 'Easy Apply'],
      dtype='object')

### 1 Remove Irrelevant columns from dataset

In [20]:
to_drop = ['index','Rating','Headquarters','Size','Founded','Type of ownership'
,'Revenue','Sector','Easy Apply','Competitors','Unnamed: 0']

In [21]:
# A DataFrame object has two axes. “axis 0” represents rows and “axis 1” represents columns.
all_data.drop(to_drop, inplace=True, axis=1)

In [6]:
all_data.head()

,Job Title,Salary Estimate,Job Description,Company Name,Location,Industry
0,Senior Data Scientist,$111K-$181K (Glassdoor est.),"ABOUT HOPPER\n\nAt Hopper, we’re on a mission ...",Hopper\n3.5,"New York, NY",Travel Agencies
1,"Data Scientist, Product Analytics",$111K-$181K (Glassdoor est.),"At Noom, we use scientifically proven methods ...",Noom US\n4.5,"New York, NY","Health, Beauty, & Fitness"
2,Data Science Manager,$111K-$181K (Glassdoor est.),Decode_M\n\nhttps://www.decode-m.com/\n\nData ...,Decode_M,"New York, NY",-1
3,Data Analyst,$111K-$181K (Glassdoor est.),Sapphire Digital seeks a dynamic and driven mi...,Sapphire Digital\n3.4,"Lyndhurst, NJ",Internet
4,"Director, Data Science",$111K-$181K (Glassdoor est.),"Director, Data Science - (200537)\nDescription...",United Entertainment Group\n3.4,"New York, NY",Advertising & Marketing

In [10]:
len(all_data.columns)

6

In [11]:
all_data['Salary Estimate'].value_counts()

$93K-$151K (Glassdoor est.)         62
$113K-$180K (Glassdoor est.)        61
$111K-$175K (Glassdoor est.)        60
$71K-$122K (Glassdoor est.)         60
$119K-$147K (Glassdoor est.)        44
                                    ..
$39K-$71K (Glassdoor est.)           7
$99K-$173K (Glassdoor est.)          6
$146K-$175K (Glassdoor est.)         3
$10-$26 Per Hour(Glassdoor est.)     3
$41K-$74K (Glassdoor est.)           1
Name: Salary Estimate, Length: 148, dtype: int64

### 2. Remove multiple rows if contains specific substrings

In [22]:
all_data[all_data['Salary Estimate'].str.contains('Per Hour', case=False)].head(2)

,Job Title,Salary Estimate,Job Description,Company Name,Location,Industry
685,"Clinical Laboratory Scientist, Per Diem",$34-$53 Per Hour(Glassdoor est.),"As the Clinical Laboratory Scientist, you will...",UC Davis Medical Center\n3.8,"Los Angeles, CA",Health Care Services & Hospitals
686,Sr. Data Analyst,$34-$53 Per Hour(Glassdoor est.),"As a Sr. Data Analyst, you will work closely w...",SAG-AFTRA Health Plan and SAG-Producers Pensio...,"Burbank, CA",-1

In [9]:
all_data = all_data.drop(all_data
[all_data['Salary Estimate'].str.contains('Per Hour', case=False) == True].index)

### 3. Handle null and missing values

In [44]:
all_data.isna().sum()

Job Title          0
Salary Estimate    0
Job Description    0
Company Name       0
Location           0
Industry           0
dtype: int64

In [17]:
all_data.isna().sum()

Job Title          0.0
Salary Estimate    0.0
Job Description    0.0
Company Name       0.0
Location           0.0
Industry           0.0
dtype: float64

In [16]:
all_data.isna().sum().sum()

0

In [17]:
all_data.isnull().sum()

Job Title          0
Salary Estimate    0
Job Description    0
Company Name       0
Location           0
Industry           0
dtype: int64

In [18]:
all_data.isnull().sum().sum()

0

In [19]:
all_data.notnull().sum()

Job Title          3888
Salary Estimate    3888
Job Description    3888
Company Name       3888
Location           3888
Industry           3888
dtype: int64

In [20]:
all_data.notnull().sum().sum()

23328

In [21]:
3909*6

23454

### 4. Transform column value if it contains specific substring.

In [22]:
(all_data[all_data['Industry'].str.contains('-1')])

,Job Title,Salary Estimate,Job Description,Company Name,Location,Industry
2,Data Science Manager,$111K-$181K (Glassdoor est.),Decode_M\n\nhttps://www.decode-m.com/\n\nData ...,Decode_M,"New York, NY",-1
7,Quantitative Research Associate,$111K-$181K (Glassdoor est.),Seeking a quant to work with senior researcher...,Enlightenment Research,"New York, NY",-1
40,Data Scientist,$120K-$140K (Glassdoor est.),We make small businesses more successful throu...,NorthOne\n4.3,"New York, NY",-1
44,Data Science Analyst,$120K-$140K (Glassdoor est.),"Job Description\nOur client, a music streaming...",MUSIC & Entertainment,"New York, NY",-1
55,"Data Scientist, Analytics & Inference",$120K-$140K (Glassdoor est.),"Hello, World! Codecademy has helped over 45 mi...",Codeacademy,"New York, NY",-1
...,...,...,...,...,...,...
3880,Data Science Technical Lead / Architect,$39K-$86K (Glassdoor est.),Urgent need for DATASCIENCE TECHNICAL LEAD ARC...,DATAECONOMY\n5.0,"Columbus, OH",-1
3882,Big Data Engineer,$55K-$112K (Glassdoor est.),RESPONSIBILITIES Kforce has a client in search...,Kforce Technology Staffing,"Columbus, OH",-1
3883,"Columbus Opportunities: Finance, Accounting, D...",$55K-$112K (Glassdoor est.),Job Description\nWe are experts at conducting ...,"Rainmaker Resources, LLC","Columbus, OH",-1
3886,Big Data Engineer,$55K-$112K (Glassdoor est.),Job Description:\nAct as a strong developer us...,Zllius Inc.,"Columbus, OH",-1
3897,Senior Data Engineer,$55K-$112K (Glassdoor est.),Job Responsibility:\nBased on business strateg...,Kognetics\n3.6,"Gahanna, OH",-1

In [23]:
all_data.loc[
    all_data['Industry']== '-1', 'Industry']= 'Private'

In [24]:
all_data

,Job Title,Salary Estimate,Job Description,Company Name,Location,Industry
0,Senior Data Scientist,$111K-$181K (Glassdoor est.),"ABOUT HOPPER\n\nAt Hopper, we’re on a mission ...",Hopper\n3.5,"New York, NY",Travel Agencies
1,"Data Scientist, Product Analytics",$111K-$181K (Glassdoor est.),"At Noom, we use scientifically proven methods ...",Noom US\n4.5,"New York, NY","Health, Beauty, & Fitness"
2,Data Science Manager,$111K-$181K (Glassdoor est.),Decode_M\n\nhttps://www.decode-m.com/\n\nData ...,Decode_M,"New York, NY",Private
3,Data Analyst,$111K-$181K (Glassdoor est.),Sapphire Digital seeks a dynamic and driven mi...,Sapphire Digital\n3.4,"Lyndhurst, NJ",Internet
4,"Director, Data Science",$111K-$181K (Glassdoor est.),"Director, Data Science - (200537)\nDescription...",United Entertainment Group\n3.4,"New York, NY",Advertising & Marketing
...,...,...,...,...,...,...
3904,AWS Data Engineer,$55K-$112K (Glassdoor est.),About Us\n\nTachyon Technologies is a Digital ...,Tachyon Technologies\n4.4,"Dublin, OH",IT Services
3905,Data Analyst â Junior,$55K-$112K (Glassdoor est.),"Job description\nInterpret data, analyze resul...","Staffigo Technical Services, LLC\n5.0","Columbus, OH",IT Services
3906,Security Analytics Data Engineer,$55K-$112K (Glassdoor est.),Job DescriptionThe Security Analytics Data Eng...,"PDS Tech, Inc.\n3.8","Dublin, OH",Staffing & Outsourcing
3907,Security Analytics Data Engineer,$55K-$112K (Glassdoor est.),The Security Analytics Data Engineer will inte...,Data Resource Technologies\n4.0,"Dublin, OH",Accounting
3908,Patient Safety Physician or Safety Scientist -...,$55K-$112K (Glassdoor est.),"Help us transform patients' lives.\nAt UCB, we...",UCB\n3.7,"Slough, OH",Biotech & Pharmaceuticals

In [25]:
all_data['Job Title'].value_counts()

Data Scientist                                                                        274
Data Engineer                                                                         259
Data Analyst                                                                          246
Senior Data Scientist                                                                  91
Machine Learning Engineer                                                              47
                                                                                     ...
Research Scientist - Machine Learning                                                   1
In Process Analytical Scientist                                                         1
Splunk Data Analyst                                                                     1
Applied Research Scientist - Computer Vision                                            1
Scientist, Data, Methods and Analytics Immuno-inflammation and Specialty Medicines      1
Name: Job Title, Length: 2065, dtype: int64

In [26]:
all_data.loc[
    all_data['Job Title'].str.contains('analyst', case=False), 'job Title'
] = 'Data Analyst'

In [27]:
all_data.loc[
    all_data['Job Title'].str.contains('scientist',case=False), 'Job Title'
] = 'Data Scientist'

In [28]:
all_data.loc[
    all_data['Job Title'].str.contains('engineer',case=False), 'Job Title'
] = 'Data Engineer'

### 5. Remove substring from string column

In [30]:
#remove substring from string column
remove = ['(Glassdoor est.)','$','(Employer est.)',')','(']
for string in remove:
      all_data['Salary Estimate'] = all_data['Salary Estimate'].str.replace(string,'')

2023-06-14 12:14:06,646 [20420] WARNING  py.warnings:110: [JupyterRequire] c:\users\pc\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  after removing the cwd from sys.path.

2023-06-14 12:14:06,659 [20420] WARNING  py.warnings:110: [JupyterRequire] c:\users\pc\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  after removing the cwd from sys.path.

### 6. Split string column by separator and convert result to int type.

In [31]:
all_data[['Estimate Min Salary', 'Estimate Max Salary']] = all_data['Salary Estimate'].str.split("-", expand=True)

In [32]:
all_data.head()

,Job Title,Salary Estimate,Job Description,Company Name,Location,Industry,job Title,Estimate Min Salary,Estimate Max Salary
0,Data Scientist,111K-181K,"ABOUT HOPPER\n\nAt Hopper, we’re on a mission ...",Hopper\n3.5,"New York, NY",Travel Agencies,NaN,111K,181K
1,Data Scientist,111K-181K,"At Noom, we use scientifically proven methods ...",Noom US\n4.5,"New York, NY","Health, Beauty, & Fitness",NaN,111K,181K
2,Data Science Manager,111K-181K,Decode_M\n\nhttps://www.decode-m.com/\n\nData ...,Decode_M,"New York, NY",Private,NaN,111K,181K
3,Data Analyst,111K-181K,Sapphire Digital seeks a dynamic and driven mi...,Sapphire Digital\n3.4,"Lyndhurst, NJ",Internet,Data Analyst,111K,181K
4,"Director, Data Science",111K-181K,"Director, Data Science - (200537)\nDescription...",United Entertainment Group\n3.4,"New York, NY",Advertising & Marketing,NaN,111K,181K

In [33]:
# Salary Estimate column become unncessary 
alldata = alldata.drop('Salary Estimate',axis=1)
del all_data['Salary Estimate']
# both lines will do same job

In [34]:
type(all_data['Estimate Min Salary'])

pandas.core.series.Series

### 7. Strip letters from the left of a string column

In [35]:
#Slice Location and Company Name string 4 index away from the left. 
all_data['Location'] = all_data['Location'].str[:-4]
all_data['Company Name'] = all_data['Company Name'].str[:-4]

In [36]:
all_data

,Job Title,Job Description,Company Name,Location,Industry,job Title,Estimate Min Salary,Estimate Max Salary
0,Data Scientist,"ABOUT HOPPER\n\nAt Hopper, we’re on a mission ...",Hopper,New York,Travel Agencies,NaN,111K,181K
1,Data Scientist,"At Noom, we use scientifically proven methods ...",Noom US,New York,"Health, Beauty, & Fitness",NaN,111K,181K
2,Data Science Manager,Decode_M\n\nhttps://www.decode-m.com/\n\nData ...,Deco,New York,Private,NaN,111K,181K
3,Data Analyst,Sapphire Digital seeks a dynamic and driven mi...,Sapphire Digital,Lyndhurst,Internet,Data Analyst,111K,181K
4,"Director, Data Science","Director, Data Science - (200537)\nDescription...",United Entertainment Group,New York,Advertising & Marketing,NaN,111K,181K
...,...,...,...,...,...,...,...,...
3904,Data Engineer,About Us\n\nTachyon Technologies is a Digital ...,Tachyon Technologies,Dublin,IT Services,NaN,55K,112K
3905,Data Analyst â Junior,"Job description\nInterpret data, analyze resul...","Staffigo Technical Services, LLC",Columbus,IT Services,Data Analyst,55K,112K
3906,Data Engineer,Job DescriptionThe Security Analytics Data Eng...,"PDS Tech, Inc.",Dublin,Staffing & Outsourcing,NaN,55K,112K
3907,Data Engineer,The Security Analytics Data Engineer will inte...,Data Resource Technologies,Dublin,Accounting,NaN,55K,112K
3908,Data Scientist,"Help us transform patients' lives.\nAt UCB, we...",UCB,Slough,Biotech & Pharmaceuticals,NaN,55K,112K

### 8. Count number of rows that contains substring appears in a column with conditions.

In [37]:
#skills we want to count 
skills_set = ['sql','python','power bi','tableau','excel',' r ']
#using for loop to frequency of each skills 
for skills in skills_set:
      print('Number of job that requires',skills,':',len(all_data[
                (all_data['Job Description'].str.contains(skills, case = False)) & 
                (all_data['Job Title']=='Data Analyst')]))

Number of job that requires sql : 183
Number of job that requires python : 75
Number of job that requires power bi : 30
Number of job that requires tableau : 63
Number of job that requires excel : 143
Number of job that requires  r  : 16